# Stepick.org — Python. Часть 4
# Практическая работа № 1


# pylint: disable=W0105


# === Задача 1 ===
"""
Вывести первые три символа строки.
"""


def m_4_1_1(data: str):
    return data[:3]


# print(m_4_1_1(input()))


# === Задача 2 ===
"""
    Вывести последние три символа строки.
    """


def m_4_1_2(data: str):
    return data[-3:]


# print(m_4_1_2(input()))


# === Задача 3 ===
"""
    Вывести все символы между первым и последним символом строки.
    """


def m_4_1_3(data: str):
    return data[:]


# print(m_4_1_3(input()))


# === Задача 4 ===
"""
    Вывести строку, начиная с четвертого символа до конца строки.
    """


def m_4_1_4(data: str):
    return data[3:]


# print(m_4_1_4(input()))
